Repository: CofficLab/GitOK
Catalog: Packages/PluginCommitStatusBar/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A green mark when the working tree matches HEAD.
zh_hans: 工作树与 HEAD 一致时显示绿色标记。
zh_hk: 工作樹與 HEAD 一致時顯示綠色標記。

source: Ahead / Behind
zh_hans: 领先 / 落后
zh_hk: 領先 / 落後

source: Ahead/Behind
zh_hans: 领先/落后
zh_hk: 領先/落後

source: Clean
zh_hans: 干净
zh_hk: 乾淨

source: Clean Indicator
zh_hans: 干净指示器
zh_hk: 乾淨指示器

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Dirty
zh_hans: 脏
zh_hk: 髒

source: Dirty Indicator
zh_hans: 脏状态指示器
zh_hk: 髒狀態指示器

source: File events keep the indicator in sync.
zh_hans: 文件事件让指示器保持同步。
zh_hk: 文件事件讓指示器保持同步。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Indicators redraw with the current state.
zh_hans: 指示器随当前状态重绘。
zh_hk: 指示器隨當前狀態重繪。

source: No Commit
zh_hans: 无提交
zh_hk: 無提交

source: Read the tree
zh_hans: 读取工作树
zh_hk: 讀取工作樹

source: Selected Commit
zh_hans: 选中的提交
zh_hk: 選取的提交

source: Stay current
zh_hans: 保持同步
zh_hk: 保持同步

source: The status service compares tree and index.
zh_hans: 状态服务对比工作树与索引。
zh_hk: 狀態服務對比工作樹與索引。

source: Uncommitted changes light up the status bar instantly.
zh_hans: 未提交改动立刻点亮状态栏。
zh_hk: 未提交改動立刻點亮狀態欄。

source: Unpushed and unpulled counts sit next to the branch.
zh_hans: 未推送与未拉取计数紧随分支显示。
zh_hk: 未推送與未拉取計數緊隨分支顯示。

source: Update the bar
zh_hans: 更新状态栏
zh_hk: 更新狀態欄

source: Your commit health, always visible at the bottom.
zh_hans: 提交健康度，始终显示在底部。
zh_hk: 提交健康度，始終顯示在底部。

source: glance
zh_hans: 一瞥
zh_hk: 一瞥

source: status
zh_hans: 状态
zh_hk: 狀態
